# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'

# Development
brew 'mysql'
brew 'node'
brew 'ruby'
brew 'nvm'

# Apps
# Comms
cask 'discord'
cask 'slack'
cask 'whatsapp'
cask 'zoom'
cask 'skype'
cask 'viber'
# Browsers
cask 'firefox'
cask 'google-chrome'
# IDE
cask 'visual-studio-code'
cask 'webstorm'
# Misc
cask 'figma'
cask 'iterm2'
cask 'notion'
brew 'thefuck'
# Entertainment
cask 'minecraft'
cask 'steam'
brew 'brogue'
cask 'vlc'
